Repository: KDE/kdev-python
Catalog: po/*/kdevpython.po
Languages: ar, hi

# NAME OF TRANSLATORS
source: Your names
ar: زايد السعيدي
hi: तुम्हारे नाम

# EMAIL OF TRANSLATORS
source: Your emails
ar: zayed.alsaidi@gmail.com
hi: आपके ईमेल

source: insert Shebang line
ar: أَدخِل سطر شي بانج
hi: शेबैंग लाइन डालें

source: specify document encoding
ar: حَدِّد ترميز المستند
hi: दस्तावेज़ एनकोडिंग निर्दिष्ट करें

source: Add file header
ar: أَضِف ترويسة ملف
hi: फ़ाइल हेडर जोड़ें

source: specify default parameter
ar: حَدِّد وسيطًا مبدئيًا
hi: डिफ़ॉल्ट पैरामीटर निर्दिष्ट करें

source: Insert next positional variable
ar: أَدخِل المتغير الموضعي التالي
hi: अगला स्थितीय चर डालें

source: Insert named variable
ar: أَدخِل متغيّرًا مُسمّى
hi: नामित चर डालें

source: Format using str()
ar: نَسِّق باستعمال $ ext{str}()$
hi: str() का उपयोग करके प्रारूपित करें

source: Format using repr()
ar: نَسِّق باستعمال $ ext{repr}()$
hi: repr() का उपयोग करके प्रारूपित करें

source: Format as left-aligned
ar: نَسِّق كـ محاذاة لليسار
hi: बाएं संरेखित स्वरूप में प्रारूपित करें

source: Format as right-aligned
ar: نَسِّق كـ محاذاة لليمين
hi: दाएं संरेखित स्वरूप में प्रारूपित करें

source: Format as centered
ar: نَسِّق كـ متوسّط
hi: केन्द्रित स्वरूप में प्रारूपित करें

source: Specify precision
ar: حَدِّد الدّقّة
hi: परिशुद्धता निर्दिष्ट करें

source: Format as percentage
ar: نَسِّق كـ نسبة مئويّة
hi: प्रतिशत के रूप में प्रारूपित करें

source: Format as character
ar: نَسِّق كـ محرف
hi: वर्ण के रूप में प्रारूपित करें

source: Format as binary number
ar: نَسِّق كـ رقم ثنائي
hi: बाइनरी संख्या के रूप में प्रारूपित करें

source: Format as octal number
ar: نَسِّق كـ رقم ثماني
hi: अष्टक संख्या के रूप में प्रारूपित करें

source: Format as hexadecimal number
ar: نَسِّق كـ رقم سداسي عشري
hi: हेक्साडेसिमल संख्या के रूप में प्रारूपित करें

source: Format in scientific (exponent) notation
ar: نَسِّق بالتنسيق العلمي (الأُسّي)
hi: वैज्ञानिक (घातांक) संकेतन में प्रारूप

source: Format as fixed point number
ar: نَسِّق كـ رقم ثابت النقطة
hi: निश्चित बिंदु संख्या के रूप में प्रारूपित करें

source: Initialize property
ar: هَيِّئ الخاصيّة
hi: संपत्ति आरंभ करें

source: function
ar: دالّة
hi: समारोह

# programming; %1 is a code statement to be added in the editor
source: Add "%1"
ar: أَضِف «%1»
hi: "%1"जोड़ें

source: Specify type for "%1"...
ar: حَدِّد نوعًا لـ «%1»...
hi: "%1" के लिए प्रकार निर्दिष्ट करें...

source: Function return type
ar: نوع قيمة الإرجاع للدالة
hi: फ़ंक्शन वापसी प्रकार

source: Local variable
ar: متغيّر محليّ
hi: स्थानीय चर

source: Sorry, cannot create hints for files which are not part of a project.
ar: آسف، لا يمكن إنشاء تلميحات للملفات التي ليست جزءًا من مشروع.
hi: क्षमा करें, उन फ़ाइलों के लिए संकेत नहीं बनाए जा सकते जो किसी प्रोजेक्ट का हिस्सा नहीं हैं।

source: Specify correct type
ar: حَدِّد النوع الصحيح
hi: सही प्रकार निर्दिष्ट करें

source: Kind:
ar: النّوع:
hi: दयालु:

source: Identifier:
ar: المعرِّف:
hi: पहचानकर्ता:

source: Correct type:
ar: النوع الصحيح:
hi: सही प्रकार:

source: Code which evaluates to the type, e.g. int()
ar: الشيفرة التي تَقِيّم إلى النوع، مثل $ ext{int}()$
hi: कोड जो प्रकार का मूल्यांकन करता है, जैसे int()

source: Required modules:
ar: الوحدات المطلوبة:
hi: आवश्यक मॉड्यूल:

source: A comma separated list of modules required for the type
ar: قائمة مفصولة بفواصل للوحدات المطلوبة للنوع
hi: प्रकार के लिए आवश्यक मॉड्यूल की अल्पविराम से अलग की गई सूची

source: The program being debugged raised an uncaught exception.
ar: البرنامج الذي يُنقَّح أثار استثناءً غير مُلتقَط.

source: You can now inspect the status of the program after it exited.
ar: يُمكنك الآن فحص حالة البرنامج بعد أن خَرَج.

source: The debugger will silently stop when the next command is triggered.
ar: سـيتوقّف المُنقِّح بصمت عند إطلاق الأمر التالي.

source: A plugin to debug Python applications with pdb.
ar: مُلحَق لتنقيح تطبيقات بايثون باستعمال $ ext{pdb}$.
hi: पीडीबी के साथ पायथन अनुप्रयोगों को डीबग करने के लिए एक प्लगइन।

source: Sorry, debugging is only supported for Python 3.x applications.
ar: آسف، تنقيح الأخطاء مدعوم فقط لتطبيقات بايثون 3.x.
hi: क्षमा करें, डिबगिंग केवल पायथन 3.x अनुप्रयोगों के लिए समर्थित है।

source: Unsupported interpreter
ar: مفسّر غير مدعوم
hi: असमर्थित दुभाषिया

source: Failed to find a valid data directory for kdevpythonsupport.
ar: فشل في إيجاد دليل بيانات صالح لـ $ ext{kdevpythonsupport}$.
hi: kdevpythonsupport के लिए वैध डेटा निर्देशिका खोजने में विफल।

source: Generate...
ar: أَنْشِئ...
hi: उत्पन्न...

source: Import From Editor
ar: اِستورد من المحرّر
hi: संपादक से आयात करें

source: Copy the contents of the active editor window to a new file in the documentation directory
ar: اِنسخ محتويات نافذة المحرّر النشط إلى ملف جديد في دليل التوثيق
hi: सक्रिय संपादक विंडो की सामग्री को डॉक्यूमेंटेशन निर्देशिका में एक नई फ़ाइल में कॉपी करें

source: Open File Manager
ar: اِفتح مدير الملفّات
hi: फ़ाइल प्रबंधक खोलें

# Edit selected files
source: Edit Selected
ar: عَدِّل المُختار
hi: चयनित संपादित करें

source: Search Paths...
ar: مسارات البحث...
hi: खोज पथ...

# displays a list of search paths below
source: Paths searched for documentation by kdev-python (in this order):
ar: المسارات التي يَبحث فيها $ ext{kdev-python}$ عن التوثيق (بهذا الترتيب):
hi: kdev-python द्वारा दस्तावेज़ीकरण के लिए खोजे गए पथ (इस क्रम में):

source: Enter a relative target path to copy %1 to:
ar: أَدخِل مسارًا نسبيًّا للهدف لنسخ %1 إليه:
hi: %1 को कॉपी करने के लिए सापेक्ष लक्ष्य पथ दर्ज करें:

source: This path must match what you use in Python to import this module. For example, enter "numpy/fft.py" for numpy.fft
ar: يَجب أن يتطابق هذا المسار مع ما تستعمله في بايثون لاستيراد هذه الوحدة. على سبيل المثال، أَدخِل «$ ext{numpy/fft.py}$» لـ $ ext{numpy.fft}$
hi: यह पथ उससे मेल खाना चाहिए जो आप इस मॉड्यूल को आयात करने के लिए पायथन में उपयोग करते हैं। उदाहरण के लिए, numpy.fft के लिए "numpy/fft.py" दर्ज करें

source: After copying, you will be editing the new document.
ar: بعد النسخ، سـتُعدِّل المستند الجديد.
hi: कॉपी करने के बाद, आप नये दस्तावेज़ को संपादित करेंगे।

source: Please select at least one file from the list for editing.
ar: اِختر ملفًّا واحدًا على الأقل من القائمة للتعديل.
hi: कृपया संपादन के लिए सूची से कम से कम एक फ़ाइल का चयन करें।

source: Configure the Python interpreter to use
ar: اضبط مفسّر بايثون لاستعماله
hi: उपयोग करने के लिए पायथन इंटरप्रेटर को कॉन्फ़िगर करें

source: Python executable
ar: تنفيذي بايثون
hi: पायथन निष्पादन योग्य

source: Select a python module to generate documentation for
ar: اِختر وحدة بايثون لتوليد توثيقها
hi: दस्तावेज़ बनाने के लिए एक पायथन मॉड्यूल का चयन करें

# refers to selecting a python module to perform some operation on
source: Target module (e.g. "math")
ar: وحدة الهدف (مثال «$ ext{math}$»)
hi: लक्ष्य मॉड्यूल (जैसे "गणित")

source: Output filename
ar: اسم ملف الخرج
hi: आउटपुट फ़ाइल नाम

source: Status and output
ar: الحالة والخرج
hi: स्थिति और आउटपुट

source: The process has not been run yet.
ar: العمليّة لم تُشغَّل بعد.
hi: प्रक्रिया अभी तक शुरू नहीं हुई है.

source: Script output
ar: خرج السكربت
hi: स्क्रिप्ट आउटपुट

source: Results
ar: النتائج
hi: परिणाम

source: Close
ar: أَغلِق
hi: बंद करना

source: Save and close
ar: اِحفظ وأَغلِق
hi: सहेजें और बंद करें

source: Generate
ar: أَنْشِئ
hi: उत्पन्न

source: Couldn't find the introspect.py script; check your installation!
ar: لم أَجِد سكربت $ ext{introspect.py}$؛ اِفحص تنصيبك!
hi: introspect.py स्क्रिप्ट नहीं मिल सकी; अपनी स्थापना की जाँच करें!

source: Couldn't find a valid kdev-python data directory; check your installation!
ar: لم أَجِد دليل بيانات $ ext{kdev-python}$ صالح؛ اِفحص تنصيبك!
hi: वैध kdev-python डेटा निर्देशिका नहीं मिल सकी; अपनी स्थापना की जाँच करें!

source: Invalid output filename
ar: اسم ملف الخرج غير صالح
hi: अमान्य आउटपुट फ़ाइल नाम

source: The output file <br/>%1<br/> already exists, do you want to overwrite it?
ar: ملف الخرج <br/>%1<br/> موجود بالفعل، أَتُريد الكتابة فوقه؟
hi: आउटपुट फ़ाइल<br/> %1<br/> पहले से मौजूद है, क्या आप इसे अधिलेखित करना चाहते हैं?

source: This file contains auto-generated documentation extracted from python run-time information. It is analyzed by KDevelop to offer features such as code-completion and syntax highlighting. If you discover errors in KDevelop's support for this module, you can edit this file to correct the errors, e.g. you can add additional return statements to functions to control the return type to be used for that function by the analyzer. Make sure to keep a copy of your changes so you don't accidentally overwrite them by re-generating the file.
ar: يحتوي هذا الملف على توثيق مُولَّد آليًّا مُستَخرَج من معلومات تشغيل بايثون. يُحلّله كيديڤلوب لتقديم ميزات مثل الإكمال التلقائي للشيفرة وتظليل الصيغة. إذا اِكتشفت أخطاءً في دعم كيديڤلوب لهذه الوحدة، يُمكنك تعديل هذا الملف لتصحيح الأخطاء، على سبيل المثال، يُمكنك إضافة عبارات إرجاع إضافيّة للدوال للتحكم بنوع الإرجاع المُستخدَم لهذه الدالة من قِبَل المُحلِّل. تأكَّد من إبقاء نسخة من تغييراتك كي لا تقوم بـ الكتابة فوقها عن طريق إعادة توليد الملف آليًّا عن طريق الخطأ.
hi: इस फ़ाइल में स्वचालित रूप से जेनरेट किए गए दस्तावेज़ हैं, जो पाइथन रन-टाइम जानकारी से निकाले गए हैं। कोड-पूर्णता और सिंटैक्स हाइलाइटिंग जैसी सुविधाएँ प्रदान करने के लिए KDevelop द्वारा इसका विश्लेषण किया जाता है। यदि आपको इस मॉड्यूल के लिए KDevelop के समर्थन में त्रुटियाँ मिलती हैं, तो आप त्रुटियों को ठीक करने के लिए इस फ़ाइल को संपादित कर सकते हैं, उदाहरण के लिए आप विश्लेषक द्वारा उस फ़ंक्शन के लिए उपयोग किए जाने वाले रिटर्न प्रकार को नियंत्रित करने के लिए फ़ंक्शन में अतिरिक्त रिटर्न स्टेटमेंट जोड़ सकते हैं। अपने परिवर्तनों की एक प्रति रखना सुनिश्चित करें ताकि आप फ़ाइल को फिर से जेनरेट करके गलती से उन्हें अधिलेखित न कर दें।

source: Manage Documentation Files Used by the Python Plugin
ar: أَدِر ملفّات التوثيق المستخدَمة من قِبَل مُلحَق بايثون
hi: पायथन प्लगइन द्वारा उपयोग की जाने वाली दस्तावेज़ फ़ाइलों का प्रबंधन करें

source: Python Documentation
ar: توثيق بايثون
hi: पायथन दस्तावेज़ीकरण

source: Generate documentation for module "%1"...
ar: أَنْشِئ توثيقًا للوحدة «%1»...
hi: मॉड्यूल "%1" के लिए दस्तावेज़ तैयार करें...

source: Module "%1" not found
ar: لم أَجِد الوحدة «%1»
hi: मॉड्यूल "%1" नहीं मिला

source: Declaration for "%1" not found in specified module
ar: لم أَجِد التصريح لـ «%1» في الوحدة المحدّدة
hi: "%1" के लिए घोषणा निर्दिष्ट मॉड्यूल में नहीं मिली

source: First argument of class method is not called self or cls, this is deprecated
ar: الوسيط الأول لدالة الصنف ليس $ ext{self}$ أو $ ext{cls}$، هذا مهجور
hi: क्लास विधि का पहला तर्क self या cls नहीं कहा जाता है, यह अप्रासंगिक है

source: Non-static class method without arguments, must have at least one (self)
ar: دالة صنف غير ساكنة بدون وسائط، يجب أن يكون لها واحد على الأقل ($ ext{self}$)
hi: तर्कों के बिना गैर-स्थिर वर्ग विधि, कम से कम एक (स्वयं) होना चाहिए

source: Return statement not within function declaration
ar: عبارة الإرجاع ليست ضمن تصريح دالة
hi: रिटर्न स्टेटमेंट फ़ंक्शन घोषणा के अंतर्गत नहीं है

# refers to an unknown type in programming
source: unknown
ar: مجهول
hi: अज्ञात

# as in list of int, set of string
source: %1 of %2
ar: %1 من %2
hi: %2 में से %1

# some object that can be called, in programming
source: <callable>
ar: <قابل للاستدعاء>
hi: <कॉल करने योग्य>

# a set with some elements
source: <iterable>
ar: <قابل للتكرار>
hi: <पुनरावर्तनीय>

# refers to a type (in program code) which is not known
source: mixed
ar: مختلط
hi: मिश्रित

# refers to a type (in program code) which can have multiple values
source: unsure (%1)
ar: غير متأكد (%1)
hi: अनिश्चित (%1)

source: Undefined variable: %1
ar: متغيّر غير مُعرَّف: %1
hi: अपरिभाषित चर: %1

source: Attribute "%1" not found on accessed object
ar: لم أَجِد السِّمة «%1» على الكائن الذي وُصِل
hi: एक्सेस की गई वस्तु पर विशेषता "%1" नहीं मिली

source: Configure Python Style Checking
ar: اضبط فحص نمط بايثون
hi: पायथन शैली जाँच कॉन्फ़िगर करें

source: Python Style Checking
ar: فحص نمط بايثون
hi: पायथन शैली जाँच

source: Enable Style Checking
ar: مَكِّن فحص النمط
hi: शैली जाँच सक्षम करें

source: Comma-separated list of error codes
ar: قائمة مفصولة بفواصل لرموز الخطأ
hi: त्रुटि कोडों की अल्पविराम से अलग की गई सूची

source: Enable these errors and warnings:
ar: مَكِّن هذه الأخطاء والتحذيرات:
hi: इन त्रुटियों और चेतावनियों को सक्षम करें:

source: Maximum line length:
ar: طول السطر الأقصى:
hi: अधिकतम पंक्ति लंबाई:

source: Disable these errors and warnings:
ar: عَطِّل هذه الأخطاء والتحذيرات:
hi: इन त्रुटियों और चेतावनियों को अक्षम करें:

source: The `pycodestyle` Python module must be installed in order to use style checking.
ar: يَجب تنصيب وحدة بايثون $ ext{pycodestyle}$ لاستعمال فحص النمط.
hi: शैली जाँच का उपयोग करने के लिए `pycodestyle` पायथन मॉड्यूल स्थापित होना चाहिए।

source: Python interpreter:
ar: مفسّر بايثون:
hi: पायथन इंटरप्रेटर:

source: Full path to python interpreter, leave empty for default
ar: المسار الكامل لمفسّر بايثون، اِتركه فارغًا للمبدئي
hi: पायथन इंटरप्रेटर का पूर्ण पथ, डिफ़ॉल्ट के लिए रिक्त छोड़ दें

source: Python Settings
ar: إعدادات بايثون
hi: पायथन सेटिंग्स

source: Format source with the autopep8 formatter.
ar: نَسِّق المصدر مع مُنسِّق $ ext{autopep8}$.
hi: ऑटोपेप8 फ़ॉर्मेटर के साथ स्रोत को फ़ॉर्मेट करें।

source: PEP8 checker error: %1
ar: خطأ فاحص $ ext{PEP8}$: %1
hi: PEP8 चेकर त्रुटि: %1

source: The PEP8 syntax checker does not seem to work correctly.
ar: لا يَعمل فاحص صيغة $ ext{PEP8}$ بشكل صحيح على ما يبدو.
hi: ऐसा प्रतीत होता है कि PEP8 सिंटैक्स परीक्षक सही ढंग से काम नहीं कर रहा है।
